inventory_service_perf/wrk_report/inventory_python312_metrics_info_logger.txt
dr@eniac-bench:~/devel/wrk2$ ./wrk  --latency -t1 -R1400  -c 100 -d 60  http://eniac-bench:8080/metrics
Running 1m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 2.831ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.91ms    3.44ms  32.29ms   95.58%
    Req/Sec     1.45k   130.94     1.78k    75.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.20ms
 75.000%    2.76ms
 90.000%    3.66ms
 99.000%   23.50ms
 99.900%   28.98ms
 99.990%   31.28ms
 99.999%   31.93ms
100.000%   32.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.690     0.000000            1         1.00
       1.353     0.100000         6939         1.11
       1.590     0.200000        13875         1.25
       1.816     0.300000        20796         1.43
       2.019     0.400000        27741         1.67
       2.203     0.500000        34679         2.00
       2.303     0.550000        38116         2.22
       2.415     0.600000        41596         2.50
       2.525     0.650000        45047         2.86
       2.635     0.700000        48540         3.33
       2.759     0.750000        52000         4.00
       2.851     0.775000        53725         4.44
       2.953     0.800000        55445         5.00
       3.067     0.825000        57174         5.71
       3.197     0.850000        58926         6.67
       3.361     0.875000        60648         8.00
       3.503     0.887500        61506         8.89
       3.659     0.900000        62374        10.00
       3.815     0.912500        63245        11.43
       4.059     0.925000        64103        13.33
       4.455     0.937500        64976        16.00
       4.743     0.943750        65403        17.78
       5.251     0.950000        65836        20.00
       6.571     0.956250        66268        22.86
       9.375     0.962500        66703        26.67
      12.223     0.968750        67134        32.00
      13.511     0.971875        67351        35.56
      14.983     0.975000        67568        40.00
      16.655     0.978125        67785        45.71
      18.399     0.981250        68002        53.33
      20.207     0.984375        68218        64.00
      21.055     0.985938        68326        71.11
      21.967     0.987500        68433        80.00
      23.023     0.989062        68542        91.43
      23.855     0.990625        68652       106.67
      24.607     0.992188        68760       128.00
      24.959     0.992969        68815       142.22
      25.343     0.993750        68867       160.00
      25.679     0.994531        68922       182.86
      26.127     0.995313        68977       213.33
      26.527     0.996094        69030       256.00
      26.815     0.996484        69057       284.44
      27.055     0.996875        69084       320.00
      27.295     0.997266        69112       365.71
      27.487     0.997656        69137       426.67
      27.855     0.998047        69164       512.00
      28.063     0.998242        69178       568.89
      28.271     0.998437        69191       640.00
      28.463     0.998633        69207       731.43
      28.671     0.998828        69218       853.33
      29.023     0.999023        69232      1024.00
      29.119     0.999121        69241      1137.78
      29.167     0.999219        69246      1280.00
      29.343     0.999316        69252      1462.86
      29.487     0.999414        69260      1706.67
      29.839     0.999512        69267      2048.00
      29.871     0.999561        69269      2275.56
      30.143     0.999609        69272      2560.00
      30.335     0.999658        69276      2925.71
      30.495     0.999707        69280      3413.33
      30.815     0.999756        69283      4096.00
      30.831     0.999780        69284      4551.11
      30.943     0.999805        69286      5120.00
      31.071     0.999829        69289      5851.43
      31.071     0.999854        69289      6826.67
      31.247     0.999878        69291      8192.00
      31.279     0.999890        69292      9102.22
      31.327     0.999902        69293     10240.00
      31.359     0.999915        69294     11702.86
      31.359     0.999927        69294     13653.33
      31.471     0.999939        69295     16384.00
      31.663     0.999945        69296     18204.44
      31.663     0.999951        69296     20480.00
      31.807     0.999957        69297     23405.71
      31.807     0.999963        69297     27306.67
      31.807     0.999969        69297     32768.00
      31.935     0.999973        69298     36408.89
      31.935     0.999976        69298     40960.00
      31.935     0.999979        69298     46811.43
      31.935     0.999982        69298     54613.33
      31.935     0.999985        69298     65536.00
      32.303     0.999986        69299     72817.78
      32.303     1.000000        69299          inf
#[Mean    =        2.909, StdDeviation   =        3.442]
#[Max     =       32.288, Total count    =        69299]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  83700 requests in 1.00m, 605.03MB read
Requests/sec:   1395.00
Transfer/sec:     10.08MB