inventory_service_perf/wrk_report/inventory_python312_metrics_info_logger_wrk.txt
$ ./wrk  --latency -t1 -R1200  -c 100 -d 120  http://eniac-bench:8080/metrics 
Running 2m test @ http://eniac-bench:8080/metrics
  1 threads and 100 connections
  Thread calibration: mean lat.: 2.037ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.06ms    1.53ms  34.62ms   96.61%
    Req/Sec     1.27k   105.97     1.78k    87.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.87ms
 75.000%    2.35ms
 90.000%    2.86ms
 99.000%    7.66ms
 99.900%   20.70ms
 99.990%   32.10ms
 99.999%   33.25ms
100.000%   34.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.687     0.000000            1         1.00
       1.107     0.100000        13179         1.11
       1.371     0.200000        26305         1.25
       1.533     0.300000        39444         1.43
       1.704     0.400000        52591         1.67
       1.867     0.500000        65750         2.00
       1.949     0.550000        72335         2.22
       2.028     0.600000        78868         2.50
       2.119     0.650000        85512         2.86
       2.227     0.700000        91984         3.33
       2.347     0.750000        98671         4.00
       2.407     0.775000       101850         4.44
       2.479     0.800000       105220         5.00
       2.551     0.825000       108450         5.71
       2.637     0.850000       111722         6.67
       2.725     0.875000       115011         8.00
       2.783     0.887500       116637         8.89
       2.859     0.900000       118290        10.00
       2.925     0.912500       119913        11.43
       2.999     0.925000       121565        13.33
       3.087     0.937500       123190        16.00
       3.131     0.943750       124037        17.78
       3.175     0.950000       124846        20.00
       3.259     0.956250       125664        22.86
       3.473     0.962500       126476        26.67
       3.631     0.968750       127303        32.00
       3.693     0.971875       127705        35.56
       3.751     0.975000       128127        40.00
       3.807     0.978125       128528        45.71
       3.865     0.981250       128939        53.33
       4.247     0.984375       129346        64.00
       4.479     0.985938       129552        71.11
       5.523     0.987500       129758        80.00
       6.859     0.989062       129962        91.43
       8.455     0.990625       130169       106.67
       9.983     0.992188       130373       128.00
      10.871     0.992969       130476       142.22
      11.791     0.993750       130578       160.00
      12.863     0.994531       130681       182.86
      14.079     0.995313       130784       213.33
      15.127     0.996094       130886       256.00
      15.599     0.996484       130939       284.44
      16.295     0.996875       130990       320.00
      16.911     0.997266       131040       365.71
      17.551     0.997656       131092       426.67
      18.239     0.998047       131143       512.00
      18.591     0.998242       131169       568.89
      18.991     0.998437       131194       640.00
      19.375     0.998633       131221       731.43
      20.063     0.998828       131246       853.33
      21.023     0.999023       131271      1024.00
      21.615     0.999121       131285      1137.78
      22.111     0.999219       131297      1280.00
      23.199     0.999316       131310      1462.86
      24.143     0.999414       131323      1706.67
      25.199     0.999512       131335      2048.00
      26.367     0.999561       131342      2275.56
      27.135     0.999609       131348      2560.00
      28.207     0.999658       131355      2925.71
      28.879     0.999707       131361      3413.33
      29.903     0.999756       131367      4096.00
      30.431     0.999780       131371      4551.11
      30.847     0.999805       131374      5120.00
      31.023     0.999829       131377      5851.43
      31.471     0.999854       131380      6826.67
      31.631     0.999878       131383      8192.00
      31.935     0.999890       131385      9102.22
      32.111     0.999902       131388     10240.00
      32.111     0.999915       131388     11702.86
      32.383     0.999927       131390     13653.33
      32.431     0.999939       131391     16384.00
      32.623     0.999945       131392     18204.44
      32.687     0.999951       131393     20480.00
      32.735     0.999957       131394     23405.71
      32.927     0.999963       131396     27306.67
      32.927     0.999969       131396     32768.00
      32.927     0.999973       131396     36408.89
      32.927     0.999976       131396     40960.00
      33.151     0.999979       131397     46811.43
      33.151     0.999982       131397     54613.33
      33.151     0.999985       131397     65536.00
      33.247     0.999986       131398     72817.78
      33.247     0.999988       131398     81920.00
      33.247     0.999989       131398     93622.86
      33.247     0.999991       131398    109226.67
      33.247     0.999992       131398    131072.00
      34.655     0.999993       131399    145635.56
      34.655     1.000000       131399          inf
#[Mean    =        2.058, StdDeviation   =        1.526]
#[Max     =       34.624, Total count    =       131399]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  143752 requests in 2.00m, 1.02GB read
Requests/sec:   1197.93
Transfer/sec:      8.66MB